# ფაილის ,,ლოკაციები" ანუ path სრულიად თქვენს სურვილს მოარგეთ...
# ასევე, ყველაფერს წერთ ფუნქციებით.
# Happy Pythoning! 🚀


# 1 - შექმენით ფაილი და შეინახეთ მასში ორი ინტეჯერ ტიპის მონაცემი. საბოლოოდ, შექმენით ახალი ფაილი სადაც შეინახავთ მათ განაყოფს.
# პირველი ფაილი -- შეიცავს ორ რიცხვს
# მეორე ფაილი --  ინახავს მათ განაყოფს
# გაითვალისწინეთ ZeroDivisionError 


# 2 - გაქვთ ფაილი რომელიც შეიცავს გარკვეულ მონაცემებს(ანუ ჩანაწერს :) ), დააკოპირეთ მასში არსებული კონტენტი სხვა destination.txt ფაილში, რომელიც აუცილებლად დესკტოპზე უნდა იყოს. 


# 3 - აიღეთ თქვენს მოწყობილობაში არსებული .txt ფაილი, და დათვალეთ მასში არსებული ხაზების ოდენობა, თუ ფაილი არ არსებობს, დაამუშავეთ FileNotFoundError


# ALGORITHM-FOCUSED TASK
# თავისუფალ დროს გადახედეთ და დაწერეთ, სავალდებულო არა, თუმცა სასურველია

# დავალება: ფაილის ხაზების შებრუნება           
# __________________________________________|

# სთხოვეთ მომხმარებელს შეიყვანოს ფაილის სახელი. საბოლოოდ, 

# - წაიკითხეთ ყველა სტრიქონი(ხაზი) ფაილიდან.
# - თითოეულ ხაზში შეაბრუნეთ სიმბოლოები (ანუ წყობა გახდეს მარჯვნიდან მარცხნივ -> hello -> olleh).
# - გამოიყენეთ seek(0) დასაწყისში გადასასვლელად.
# - გადაწერეთ ფაილი შებრუნებული ხაზებით.
# - დაამუშავეთ შეცდომები
# - მიიღეთ ახალი ფაილი აღნიშნული წყობით



