import random
import string


# ============================================================
# ძლიერი პაროლის გენერირების ფუნქცია
# ============================================================

def generate_strong_password(length: int) -> str:

    # ========================================================
    # ვაერთიანებთ ყველა შესაძლო სიმბოლოს
    # ========================================================
    #    string.ascii_letters <- შეიცავს: abcdefghijklmnopqrstuvwxyz ABCDEFGHIJKLMNOPQRSTUVWXYZ
    #    string.digits შეიცავს: 0123456789
    #    string.punctuation შეიცავს სპეციალურ სიმბოლოებს: !"#$%&'()*+,-./:;<=>?@[\]^_`{|}~
    # ========================================================

    characters = (string.ascii_letters + string.digits + string.punctuation)


    # ========================================================
    # თავდაპირველად პაროლი ცარიელია
    # ========================================================

    password = ""

    # ========================================================
    # ციკლი შესრულდება იმდენჯერ,
    # რამდენი სიმბოლოც უნდა ჰქონდეს პაროლს
    # ========================================================

    for i in range(length):


        # random.choice() შემთხვევით ირჩევს
        # ერთ სიმბოლოს characters-დან
        random_character = random.choice(characters)

        # არჩეულ სიმბოლოს ვამატებთ პაროლში
        password = password + random_character


    # ========================================================
    # ფუნქცია აბრუნებს შექმნილ პაროლს
    # ========================================================

    return password


# ============================================================
# მომხმარებლისგან პაროლის სიგრძის მიღება
# ============================================================

while True:

    try:

        # მომხმარებელს შემოაქვს პაროლის სასურველი სიგრძე
        length = int(input("შეიყვანეთ პაროლის სიგრძე: "))

        # ====================================================
        # პაროლი უნდა შეიცავდეს მინიმუმ 8 სიმბოლოს
        # ====================================================

        if length < 8:

            raise ValueError("პაროლის სიგრძე უნდა იყოს " "მინიმუმ 8 სიმბოლო.")

        # თუ ყველაფერი სწორია, ვწყვეტთ while ციკლს
        break


    # ========================================================
    # არასწორი მონაცემის დამუშავება
    # ========================================================

    except ValueError as error:

        print()
        print("შეცდომა:", error)
        print()


# ============================================================
# ფუნქციის გამოძახება
# ============================================================

password = generate_strong_password(length)


# ============================================================
# შედეგის დაბეჭდვა
# ============================================================

print()
print("გენერირებული პაროლი:")
print(password)