
# /////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

# 1 -- დაწერეთ ფუნქცია find_max(), რომელიც არგუმენტად იღებს რიცხვების სიას და აბრუნებს სიიდან ყველაზე დიდ რიცხვს.
# find_max([2, 8, 4, 1, 7])  # Output: 8



# ///////////////////////////////////////////////////////////////////////////////////////////


# 2 -- დაწერეთ ფუნქცია sum_of_evens(ნომრები), რომელიც აბრუნებს ყველა ლუწი რიცხვის ჯამს მთელი რიცხვების სიიდან.
# sum_of_evens([1, 2, 3, 4, 5])  # Output: 6 (ანუ 2 + 4 = 6)



# ///////////////////////////////////////////////////////////////////////////////////////////



# 3 -- დაწერეთ ფუნქცია count_occurrences (), რომელიც აბრუნებს რამდენჯერ გამოჩნდება მითითებული ელემენტი  სიაში.
# count_occurrences([1, 2, 2, 3, 2], 2)  # Output: 3


# ///////////////////////////////////////////////////////////////////////////////////////////
# (სურვილის მიხედვით გააკეთეთ ეს დავალება)
# 4 -- სტუდენტთა შეფასების სისტემა(return-ების გამოყენებით)
# დაწერეთ პროგრამა, რომელიც ითვლის სტუდენტის საბოლოო შეფასებას მათი გამოცდის ქულების მიხედვით, შემდეგ დაყოფს ქულებს ერთ-ერთ შემდეგ კატეგორიად:

# A: 90 და ზემოთ
# B: 80-89
# C: 70-79
# D: 60-69
# F: 60-ზე ქვემოთ
# პროგრამამ უნდა გამოიყენოს რამდენიმე ფუნქცია დავალების სხვადასხვა ნაწილის შესასრულებლად. 

# ფუნქცია 1: calculate_average(grades)
# ეს ფუნქცია მიიღებს შეფასებების ჩამონათვალს(list-ის სახით) და დააბრუნებს საშუალო ქულას.

# ფუნქცია 2: determine_grade(average_score)
# ეს ფუნქცია არგუმენტად  მიიღებს საშუალო ქულას და დააბრუნებს შესაბამის შეფასებას (A, B, C, D, ან F).

# ფუნქცია 3: get_student_result(grades)
# ეს ფუნქცია აიღებს შეფასებების სიას, გამოიძახებს წინა ორ ფუნქციას და დააბრუნებს სტუდენტის საბოლოო შეფასებას საშუალო ქულასთან ერთად.

