# 1. ინფორმაცია შენზე 
# შექმენი ცვლადები: 
# • სახელი  
# • გვარი  
# • ასაკი  
# • სტუდენტი ხარ თუ არა (True/False)  
# დაბეჭდე ყველა მნიშვნელობა. 
# 2. მონაცემთა ტიპები 
# შექმენი 4 სხვადასხვა ტიპის ცვლადი: 
# • int  
# • float  
# • str  
# • bool  
# • გამოიყენე type() და დაბეჭდე თითოეულის ტიპი. 
# • გადაიყვანეთ და დაწერეთ type castingის ყველა შესაძლო შემთხვევა 
# 3. არითმეტიკული ოპერაციები 
# შექმენი ორი მთელი რიცხვი. 
# დაბეჭდე: 
# • ჯამი  
# • სხვაობა  
# • ნამრავლი  
# • განაყოფი  
# • მთელი განაყოფი  
# • ნაშთი  
# • ხარისხი 
# 4. სტრიქონების შეერთება 
# შექმენი ორი ცვლადი: 
# first_name 
# last_name 
# შეაერთე ისინი და დაბეჭდე სრული სახელი. 
# რთული: - არასავალდებულო 
# დაწერეთ მარტივი კალკულატორის პროგრამა. გამოიყენეთ 3 
# ინფუთი: ორი რიცხვი და მესამე ოპერაციისთვის(სადაც 
# შემოიყვანს ოპერატორს). 
# შემოყვანილი ოპერატორის საფუძველზე დაბეჭდეთ შესაბამისი 
# შედეგი. 
# შედეგი უნდა იყოს დაბეჭდილი წინადადების სახით, 
# მაგალითად: 
# „თქვენი შედეგი არის {შედეგი}“