# 1 -- გაქვთ მოცებული ორი ლექსიკონი, 
# dict1 = {'a': 1, 'b': 2}
# dict2 = {'b': 3, 'c': 4}
# დაწერეთ სკრიპტი, რომლის საშუალებითაც გააერთიანებთ ამ ორ ლექსიკონს, თუ key მნიშვნელობები ემთხვევა, მაშინ შეინახეთ ის ერთხელ გაერთიანებულ ლექსიკონში და value-დ ჰქონდეს მეორე ლექსიკონის მნიშვნელობა.


# 2 --  lst = ['apple', 'banana', 'apple', 'orange', 'banana', 'banana']
#           აღნიშნული ლისტიოსთვის შექმენით ლექსიკონი, რომელიც შეინახავს key-ში ლექსიკონის სტრინგს და value-დ მიიღებს მნიშვნელობას, რომელშიც შენახულია რამდენჯერ გვხვდება აღნიშნული სტრინგი ლისტში

# 3 -- 
# my_dict = {'a': 10, 'b': 20}
# key = 'c'
# default_value = 30     
# მოცემული ლექსიკონისთვის შეამოწმეთ არსებობს თუ არა key my_dictში, თუ არა დაამატეთ მასში key : default_value წყვილი

# 4 -- my_dict = {'a': 1, 'b': 2, 'c': 3}
# შექმენით ახალი ლექსიკონი, სადაც მოცემული ლექსიკონის გასაღებები გახდებიან მნიშვნელობები და პირიქით

# 5 -- 
# my_dict = {'a': 1, 'b': None, 'c': 3, 'd': None}
# მოცემული ლექსიკონიდან წაშალეთ წყვილი, რომლისთვისაც მნიშვნელობა არის None

# 6 -- 
# words = ['apple', 'banana', 'avocado', 'blueberry', 'cherry', 'carrot']
# მოცემულ ლისტზე დაყრდნობით, შექმენით ლექსიკონი, რომელშიც გასაღები იქნება მოცემული სტრინგების პირველი ასო და მნიშვნელობად მიიღებენ სტრინგებს, რომლებიც იწყებიან ამ ასოზე

# 7 --
# my_dict = {'a': 5, 'b': 1, 'c': 8, 'd': 3}
# დაასორტირეთ მოცემული ლექსიკონი მნიშვნელობების მიხედვით.
