# დავალება 1
# მომხმარებელს შემოატანინე სრული სახელი.
# მაგალითად
#    aNi     maiSuradze
# შესაბამისი მეთოდების გამოყენებით დაბეჭდე:
# "Welcome Ani Maisuradze!"

# -----------------------------------------------------------

# დავალება 2
# შექმენი პატარა პროგრამა, რომელიც მომხმარებელს ეკითხება:
# სახელი, გვარი, ასაკი, ქალაქი
# შემდეგ:
# მოაშორე ზედმეტი გამოტოვებები (strip()).
# სახელი და გვარი გახადე სწორ ფორმატში (capitalize() ან title()).
# დაბეჭდე სრული ინფორმაცია f-string-ით.
# (ასევე, გამოიყენეთ სტრინგების კონკატენაციის ყველა მეთოდი)

# -------------------------------------------------------------------------
# დავალება 3
# ჩამოთვალეთ პითონში არსებული ოპერატორები (თეორიულად).

# -------------------------------------------------------------------------

# დავალება 4
# მომხმარებელს შემოატანინე ნებისმიერი ტექსტი.
# დაბეჭდე:
# - ტექსტი
# - სიმბოლოების რაოდენობა (len())
# მაგალითი
# Input:
# Hello World

# Output:
# Hello World
# Length: 11