import random
import string


# ============================================================
# დავალება 14
# ძლიერი პაროლის გენერატორი
# ============================================================


# ============================================================
# ფუნქცია 1
# მომხმარებლისგან პაროლის სიგრძის მიღება
# ============================================================

def get_password_length() -> int:

    while True:

        try:

            length = int(
                input("შეიყვანეთ პაროლის სასურველი სიგრძე: ")
            )


            # პაროლისთვის ვიყენებთ მინიმუმ 8 სიმბოლოს.

            if length < 8:  # შევამოწმეთ სიგრძე და შევატყობინეთ მომხმარებელს რომ მინიმუმ 8 სიმბოლო

                raise ValueError(
                    "პაროლის სიგრძე უნდა იყოს მინიმუმ 8 სიმბოლო."
                )

            return length # დავაფიქსირეთ რაოდენობა

        except ValueError as error:

            print()
            print("შეცდომა:", error)
            print(
                "გთხოვთ, შეიყვანოთ მთელი რიცხვი 8 ან მეტი."
            )
            print()


# ============================================================
# ფუნქცია 2
# ძლიერი პაროლის გენერირება
# ============================================================

def generate_password(length: int) -> str: # ვაგენერირებთ პაროლს

    # --------------------------------------------------------
    # პაროლის აუცილებელი სიმბოლოები
    # --------------------------------------------------------

    uppercase = random.choice(string.ascii_uppercase) # string.ascii_uppercase-დან შემთხვევით ვირჩევთ ერთ დიდ ინგლისურ ასოს მაგალითად: A, B, C, D ... Z

    lowercase = random.choice(string.ascii_lowercase)# string.ascii_lowercase-დან შემთხვევით ვირჩევთ ერთ პატარა ინგლისურ ასოს მაგალითად: a, b, c, d ... z

    digit = random.choice(string.digits) # string.digits-დან შემთხვევით ვირჩევთ ერთ ციფრს შესაძლო მნიშვნელობებია: 0, 1, 2, 3 ... 9

    special_1 = random.choice(string.punctuation) # string.punctuation-დან შემთხვევით ვირჩევთ პირველ სპეციალურ სიმბოლოს მაგალითად: !, @, #, $, %, &, *, ? და სხვა

    special_2 = random.choice(string.punctuation) # string.punctuation-დან შემთხვევით ვირჩევთ მეორე სპეციალურ სიმბოლოს რადგან დავალების პირობის მიხედვით პაროლი უნდა შეიცავდეს  ორ სპეციალურ სიმბოლოს




    # --------------------------------------------------------
    # აუცილებელ სიმბოლოებს ვინახავთ სიაში
    # --------------------------------------------------------

    password_characters = [uppercase,lowercase,digit,special_1,special_2]


    # --------------------------------------------------------
    # დარჩენილი სიმბოლოების რაოდენობა მაგალითად: length = 10 აუცილებელი სიმბოლოები = 5 დარჩენილი = 5
    # --------------------------------------------------------

    remaining_length = length - 5


    # --------------------------------------------------------
    # ყველა შესაძლო სიმბოლო
    # --------------------------------------------------------

    all_characters = (string.ascii_letters+ string.digits+ string.punctuation) # ყველა შესაძლო სიმბოლოს ვაერთიანებთ ერთ ცვლადში

    # --------------------------------------------------------
    # დარჩენილ ადგილებს ვავსებთ შემთხვევითი სიმბოლოებით random.choices() აბრუნებს სიას "k" განსაზღვრავს რამდენი სიმბოლო უნდა ავირჩიოთ
    # --------------------------------------------------------

    remaining_characters = random.choices(all_characters,k=remaining_length)

    # --------------------------------------------------------
    # დარჩენილი სიმბოლოების დამატება ძირითად სიაში
    # --------------------------------------------------------

    password_characters.extend(remaining_characters)

    # --------------------------------------------------------
    # აუცილებელი სიმბოლოები რომ ყოველთვის დასაწყისში არ აღმოჩნდეს, მთელ სიას შემთხვევითად ვურევთ
    # --------------------------------------------------------

    random.shuffle(password_characters)

    # --------------------------------------------------------
    # სიას ვაქცევთ ერთ სტრინგად მაგალითად: ['A', '5', '@', 'b'] გახდება: A5@b
    # --------------------------------------------------------

    password = "".join(password_characters) # password_characters სიაში არსებული ყველა სიმბოლო 
                                            #"".join() მეთოდის გამოყენებით ერთ სტრინგად გაერთიანდება მაგალითად: ['A', 'b', '5', '@', '#'] -> "Ab5@#"
                                            #  მიღებულ პაროლს ვინახავთ password ცვლადში
    return password ## return-ის საშუალებით ფუნქციიდან ვაბრუნებთ საბოლოოდ გენერირებულ პაროლს


# ============================================================
# მთავარი ფუნქცია main() მართავს სხვა ფუნქციების მუშაობას.
# ============================================================

def main() -> None: # main ფუნქცია არაფერს აბრუნებს, ამიტომ ვიყენებთ -> None-ს

    print()
    print("======================================")
    print("ძლიერი პაროლის გენერატორი")
    print("======================================")
    print()

    
    length = get_password_length() # მომხმარებლისგან სიგრძის მიღება
    password = generate_password(length) # პაროლის გენერირება

    # შედეგის გამოტანა
    print()
    print("გენერირებული პაროლი:")
    print(password)

    print()
    print("პაროლის სიგრძე:", len(password))


# ============================================================
# პროგრამის გაშვება
# ============================================================

main()