# # # დავალება 2 — თანამშრომლების სისტემა
# # # შექმენი თანამშრომლების მართვის სისტემა.

# # # შექმენი მშობელი კლასი Employee, რომელსაც ექნება: name, salary


# # # მეთოდები:
# # # show_info()
# # # calculate_salary()

# # # შემდეგ შექმენი შვილობილი კლასები:
# # Developer
# # Manager
# # Designer

# # თითოეულ კლასს დაამატე მისთვის დამახასიათებელი დამატებითი ატრიბუტი.

# # მაგალითად:

# # Developer → programming_language
# # Manager → team_size
# # Designer → design_tool


# # თითოეულმა კლასმა თავისებურად უნდა განახორციელოს calculate_salary().
# # გამოიყენე:
# # Inheritance
# # Method Overriding (დასერჩეთ რას გულისხმობს მოცემული, კიტხვების შემთხვევაში მომმართეთ)
# # Polymorphism

# # შექმენი სხვადასხვა ტიპის თანამშრომლების სია და ერთი for ციკლის გამოყენებით  გამოიძახე მათი მეთოდები.


# # ---------------------------------------------------------------------------------------------------


# # თეორიულად და მცირე მაგალითებით აღწერეთ ოოპ-ის პრინციპები

# # ----------------------------------------------------------------------------------------------------

# # დავალება 3 — Smart Device 📱

# # შექმენი Python-ში OOP-ის გამოყენებით Smart Device-ის სისტემა.

# # შექმენი შემდეგი კლასები:
# # Device
# # Camera
# # GPS
# # Phone
# # Device

# # ატრიბუტები:
# # brand
# # model

# მეთოდი:
# show_device_info() — გამოიტანს მოწყობილობის ბრენდსა და მოდელს.

# Camera
# მეთოდები:
# take_photo() — გამოიტანს შეტყობინებას, რომ ფოტო გადაიღო.
# record_video() — გამოიტანს შეტყობინებას, რომ ვიდეო ჩაიწერა.


# GPS
# მეთოდები:
# get_location() — გამოიტანს მოწყობილობის მიმდინარე მდებარეობას.
# navigate(destination) — მიიღებს დანიშნულების ადგილსა და გამოიტანს შესაბამის შეტყობინებას.

# Phone
# Phone კლასი უნდა მემკვიდრეობდეს ერთდროულად Device, Camera და GPS კლასებიდან.

# Phone-ს დამატებით ჰქონდეს:
# ატრიბუტი:
# phone_number

# მეთოდები:
# call(number) — მოცემულ ნომერზე დარეკვა.
# send_message(number, message) — მოცემულ ნომერზე შეტყობინების გაგზავნა.

# პირობები:
# გამოიყენე Multiple Inheritance.
# Phone კლასში არ გაიმეორო Device, Camera და GPS კლასების მეთოდები.
# შექმენი მინიმუმ ერთი Phone ობიექტი.
# გამოიძახე ყველა მშობელი კლასიდან მიღებული მეთოდი.
# გამოიძახე Phone-ის საკუთარი მეთოდებიც.
# გამოიყენე super() იქ, სადაც საჭიროა.

# (მემკვიდრეობებისთვის კონკრეტულ კლასებს შეუმოწმეთ mro)