# 1. მარტივი კალკულატორი
# მომხმარებელს შეაყვანინე:
# პირველი რიცხვი
# ოპერატორი (+, -, *, /)
# მეორე რიცხვი

# დაამუშავე:
# ValueError
# ZeroDivisionError

# თუ ყველაფერი წარმატებით შესრულდა, else-ში დაბეჭდე შედეგი.
# finally-ში დაბეჭდე: "კალკულატორის მუშაობა დასრულდა.""

# # -------------------------------------------------------------------------------

# 2. რამდენიმე except

# დაწერე პროგრამა, რომელიც მომხმარებლისგან იღებს ორ მნიშვნელობას და ცდილობს:
# უნდა დაამუშაო მინიმუმ სამი შეცდომა:
# ValueError
# ZeroDivisionError
# TypeError

# else-ში დაბეჭდე შედეგი, ხოლო finally-ში — "დასრულდა".

# # ---------------------------------------------------------

# 3. საწყობის სისტემა
# საწყობში არის:
# stock = 50
# მომხმარებელს შეაყვანინე რამდენი პროდუქტის აღება სურს.

# თუ ოდენობა ვალიდურია , მაშინ - ოპერაცია წარმატებულია.
# დარჩა: 30

# დაამუშავე:
# ValueError
# უარყოფითი რაოდენობა
# მარაგზე მეტი რაოდენობის მოთხოვნა
# გამოიყენე ოთხივე ბლოკი: try, except, else, finally.

# # --------------------------------------------------------------

# 4. სასტუმროს ნომრის დაჯავშნა

# სასტუმროში დარჩენილია:

# rooms = 5
# მომხმარებელს შეაყვანინე რამდენი ნომრის დაჯავშნა სურს.

# მაგალითად: რამდენი ნომერი გსურთ? 2

# დაჯავშნა წარმატებულია.
# დარჩა 3 თავისუფალი ნომერი.

# დაამუშავე:
# არასწორი შეყვანა
# 0 ან უარყოფითი რაოდენობა
# ხელმისაწვდომზე მეტი ნომრის მოთხოვნა

# finally-ში კი დაბეჭდე: "დაჯავშნის პროცესი დასრულდა."