# ============================================================
# დავალება 17
# OOP - Student და Book კლასები
# ============================================================


# ============================================================
# Student კლასი
# ============================================================

class Student: # პირველის სტრუქტურა სტუდენტის კლასისთვის და მერე მაგისი მოქმედება რომ წიგნის და სტუდენტი ერთმანეთში სტრუქტურაში არ აურიოთ.

    # ========================================================
    # კონსტრუქტორი
    # ========================================================
    # ეს კონსტრუქტორი გამოიყენება ობიექტის შექმნისას, რათა ავტომატურად დააყენოს ობიექტის თვისებები (attributes) და მიიღოს პარამეტრები.
    def __init__(self, name, surname, age, grades): # ობიექტის შექმნისას კონსტრუქტორი ავტომატურად იძახება და პარამეტრები გადაეცემა ობიექტის შექმნისას.
        #__init__ არის სპეციალური მეთოდი, რომელიც ავტომატურად იძახება ობიექტის შექმნის დროს.
        # როდესაც Python ხედავს: Student(...) ის ავტომატურად იძახებს: __init__() და მონაცემები ნაწილდება surname, age, grades
        # სტუდენტის სახელი # 
        self.name = name # self ნიშნავს კონკრეტულ ობიექტს, რომელთანაც ამ მომენტში ვმუშაობთ. student1 ... student3 ...
                         # self.name ნიშნავს, რომ ჩვენ ვქმნით ობიექტის თვისებას სახელად name და ვაკავშირებთ მას პარამეტრს name, რომელიც გადაეცემა კონსტრუქტორს ობიექტის შექმნისას.
        # სტუდენტის გვარი
        self.surname = surname

        # სტუდენტის ასაკი
        self.age = age

        # სტუდენტის შეფასებების სია
        self.grades = grades


    # ========================================================
    # სტუდენტის საშუალო ქულის დათვლა
    # ========================================================

    def calculate_average(self): # ეს მეთოდი ითვლის სტუდენტის შეფასებების საშუალო ქულას. self.grades არის სტუდენტის შეფასებების სია, რომელიც გადაეცემა ობიექტის შექმნისას.

        # თუ შეფასებების სია ცარიელია
        if len(self.grades) == 0:

            return 0


        total = 0


        # შევაჯამოთ ყველა შეფასება
        for grade in self.grades:

            total = total + grade


        average = total / len(self.grades)


        return average


    # ========================================================
    # სტუდენტის ინფორმაციის ჩვენება
    # ========================================================

    def show_info(self): # ეს მეთოდი აჩვენებს სტუდენტის ინფორმაციას, მათ შორის სახელს, გვარს, ასაკს, შეფასებებს და საშუალო ქულას.

        print()
        print("======================================")
        print("სტუდენტის ინფორმაცია")
        print("======================================")

        print("სახელი:", self.name)

        print("გვარი:", self.surname)

        print("ასაკი:", self.age)

        print("შეფასებები:", self.grades)

        print(
            "საშუალო ქულა:",
            self.calculate_average()
        )


# ============================================================
# სტუდენტის მონაცემების შეყვანა
# ============================================================

while True: # სტუდენტის სახელი არ უნდა იყოს ცარიელი და არ უნდა შეიცავდეს ციფრებს

    name = input(
        "შეიყვანეთ სტუდენტის სახელი: "
    ).strip().title()


    if name == "":

        print(
            "შეცდომა! სახელი ცარიელი არ უნდა იყოს."
        )


    elif any(      #  სახელი შეიცავს ციფრებს
        character.isdigit()
        for character in name
    ):

        print(
            "შეცდომა! სახელი არ უნდა შეიცავდეს ციფრებს."
        )


    else:

        break


while True: # სტუდენტის გვარი არ უნდა იყოს ცარიელი და არ უნდა შეიცავდეს ციფრებს

    surname = input( 
        "შეიყვანეთ სტუდენტის გვარი: "
    ).strip().title()


    if surname == "":

        print(
            "შეცდომა! გვარი ცარიელი არ უნდა იყოს."
        )


    elif any(
        character.isdigit()
        for character in surname
    ):

        print(
            "შეცდომა! გვარი არ უნდა შეიცავდეს ციფრებს."
        )


    else:

        break


while True: # სტუდენტის ასაკი უნდა იყოს 0-ზე მეტი

    try:

        age = int(
            input(
                "შეიყვანეთ სტუდენტის ასაკი: "
            )
        )


        if age <= 0:

            raise ValueError(
                "ასაკი უნდა იყოს 0-ზე მეტი"
            )


        break


    except ValueError as error:

        print("შეცდომა:", error)


# ============================================================
# შეფასებების შეყვანა
# ============================================================

grades = []


while True: # შეფასებების რაოდენობა უნდა იყოს 0-ზე მეტი

    try:

        grades_count = int(
            input(
                "შეიყვანეთ შეფასებების რაოდენობა: "
            )
        )


        if grades_count <= 0:

            raise ValueError(
                "შეფასებების რაოდენობა უნდა იყოს 0-ზე მეტი"
            )


        break


    except ValueError as error:

        print("შეცდომა:", error)


for i in range(grades_count): # შეფასებების შეყვანა, თითოეული შეფასება უნდა იყოს 0-დან 100-მდე

    while True:

        try:

            grade = int(
                input(
                    f"შეიყვანეთ შეფასება №{i + 1}: "  # რომ მივიღოთ შედეგი "შეიყვანეთ შეფასება №1" -დან
                )
            )


            if grade < 0 or grade > 100: # შეფასების რეინჯი უნდა იყოს 0-დან 100-მდე

                raise ValueError(
                    "შეფასება უნდა იყოს 0-დან 100-მდე"
                )


            grades.append(grade) # შეფასების დამატება სიაში 

            break


        except ValueError as error:

            print("შეცდომა:", error)


# ============================================================
# Student ობიექტის შექმნა
# ============================================================

student1 = Student( # ქმნის Student კლასის ობიექტს და ინახავს მას ცვლადში: student1
    name,
    surname,
    age,
    grades
)


# სტუდენტის ინფორმაციის ჩვენება
student1.show_info() # student1.show_info() -> student1 ობიექტის show_info მეთოდის გამოძახება, რომელიც აჩვენებს სტუდენტის ინფორმაციას.
                     # student1 ობიექტი .show_info() მეთოდი

# ============================================================
# Book კლასი
# ============================================================

class Book: # მეორე კლასის სტრუქტურა წიგნის კლასისთვის და მაგისი მოქმედება 

    # ========================================================
    # კონსტრუქტორი
    # ========================================================

    def __init__(self, title, author, year, price):

        # წიგნის დასახელება
        self.title = title

        # ავტორი
        self.author = author

        # გამოცემის წელი
        self.year = year

        # წიგნის ფასი
        self.price = price


    # ========================================================
    # წიგნის ინფორმაციის ჩვენება
    # ========================================================

    def show_info(self):

        print()
        print("======================================")
        print("წიგნის ინფორმაცია")
        print("======================================")

        print("დასახელება:", self.title)

        print("ავტორი:", self.author)

        print("გამოცემის წელი:", self.year)

        print("ფასი:", self.price)


    # ========================================================
    # ფასის შეცვლა
    # ========================================================

    def change_price(self, new_price):

        if new_price <= 0:

            print(
                "შეცდომა! ფასი უნდა იყოს 0-ზე მეტი."
            )

        else:

            self.price = new_price

            print(
                "წიგნის ფასი წარმატებით შეიცვალა."
            )


# ============================================================
# წიგნის მონაცემების შეყვანა
# ============================================================

while True:

    title = input(
        "შეიყვანეთ წიგნის დასახელება: "
    ).strip()


    if title == "":

        print(
            "შეცდომა! წიგნის დასახელება ცარიელი არ უნდა იყოს."
        )


    else:

        break


while True:

    author = input(
        "შეიყვანეთ ავტორის სახელი: "
    ).strip().title()


    if author == "":

        print(
            "შეცდომა! ავტორის სახელი ცარიელი არ უნდა იყოს."
        )


    else:

        break


while True:

    try:

        year = int(
            input(
                "შეიყვანეთ გამოცემის წელი: "
            )
        )


        if year <= 0:

            raise ValueError(
                "წელი უნდა იყოს 0-ზე მეტი"
            )


        break


    except ValueError as error:

        print("შეცდომა:", error)


while True:

    try:

        price = float(
            input(
                "შეიყვანეთ წიგნის ფასი: "
            )
        )


        if price <= 0:

            raise ValueError(
                "ფასი უნდა იყოს 0-ზე მეტი"
            )


        break


    except ValueError as error:

        print("შეცდომა:", error)


# ============================================================
# Book ობიექტის შექმნა
# ============================================================

book1 = Book(
    title,
    author,
    year,
    price
)


# წიგნის ინფორმაციის ჩვენება
book1.show_info()


# ============================================================
# წიგნის ფასის შეცვლა
# ============================================================

while True:

    try:

        new_price = float(
            input(
                "შეიყვანეთ წიგნის ახალი ფასი: "
            )
        )


        if new_price <= 0:

            raise ValueError(
                "ფასი უნდა იყოს 0-ზე მეტი"
            )


        break


    except ValueError as error:

        print("შეცდომა:", error)


book1.change_price(new_price)


# შეცვლილი ინფორმაციის ჩვენება
book1.show_info()