# დავალება 1
# მომხმარებელს შემოატანინე რიცხვი და დაბეჭდე:
# "დადებითია"
# "უარყოფითია"
# "ნულია"

# -----------------------------------------------------

# დავალება 2
# შემოატანინე მომხმარებელს მთელი რიცხვი.
# თუ ლუწია, დაბეჭდე "ლუწი".
# თუ კენტია, დაბეჭდე "კენტი".

# -----------------------------------------------------

# დავალება 3
# სამი რიცხვიდან უდიდესი
# შემოაყვანინე სამი რიცხვი და დაბეჭდე ყველაზე დიდი.

# -------------------------------------------------------

# დავალება 4 - Login სისტემა
# მომხმარებელი: Admin
# პაროლი: 12389

# დაწერეთ მარტივი login სისტემა:
# თუ ორივე სწორია: -> 'წარმატებით შეხვედით'
# თუ მომხმარებელია არასწორი: -> "მომხმარებელი ვერ მოიძებნა"
# თუ პაროლია არასწორი: -> "პაროლი არასწორია"

# -------------------------------------------------------

# რთული (არჩევითი დავალება):
# ბანკომატი 
# საწყისი ბალანსი = 1200
# მომხმარებელი ირჩევს ოპერაციას:
# withdraw
# deposit
# balance
# თუ აირჩია:
# withdraw → შეიყვანოს თანხა.
# თუ თანხა მეტია ბალანსზე → "არასაკმარისი თანხა"
# თუ თანხა უარყოფითია → "არასწორი თანხა"
# წინააღმდეგ შემთხვევაში გამოიტანე ახალი ბალანსი.
# deposit
# თანხა უნდა იყოს დადებითი.
# შემდეგ დაბეჭდე ახალი ბალანსი.
# balance
# დაბეჭდე მიმდინარე ბალანსი.