# დავალება — Student კლასი 
# შექმენი კლასი Student, რომელსაც ექნება:
# name — სტუდენტის სახელი
# age — ასაკი
# course — რომელ კურსზეა

# შექმენი მეთოდი show_info(), რომელიც დაბეჭდავს სტუდენტის ინფორმაციას მოცემული ფორმატით:
# Name: Luka
# Age: 20
# Course: Python
# Subject: OOP

# შექმენით მინიმუმ ორი ობიექტი და ორივესთვის ცალ-ცალე დაბეჭდეთ შესაბამისი ატრიბუტის მნიშვნელობებიც და მეთოდიც გამოიძახეთ

# # --------------------------------------------

# დავალება — Book კლასი 📚
# შექმენი კლასი Book, რომელსაც ექნება შემდეგი ატრიბუტები:

# title — წიგნის დასახელება
# author — ავტორი
# year — გამოცემის წელი
# genre — ჟანრი

# მოთხოვნები
# შექმენი Book კლასი და __init__ კონსტრუქტორი.
# შექმენი show_info() მეთოდი, რომელიც დაბეჭდავს წიგნის ყველა ინფორმაციას.
# შექმენი __str__ მეთოდი, რომელიც ობიექტის print()-ის დროს დააბრუნებს ასეთ ტექსტს:
# Book: The Hobbit, Author: J.R.R. Tolkien, Year: 1937, Genre: Fantasy

# შექმენი მინიმუმ ორი Book ობიექტი.
# ორივე ობიექტზე გამოიძახე show_info().
# ორივე ობიექტი პირდაპირ დაბეჭდე print()-ით, რათა შეამოწმო __str__ მუშაობს თუ არა.


# შენიშვნა: არსებული ფაილი აიტანეთ გითჰაბზე, დამიწერეთ რა ქომანდები და პროცესი ჩაატარეთ და საბოლოო ფაილთან ერთად,
# დავალებაში, ამიტვირთეთ გითჰაბის რეპოზიტორიის ლინკიც.