# დაწერეთ პაროლების გენერირების პროგრამა რომელიც უნდა აკმაყოფილებდეს შემდეგ მოტხოვნებს:
# - პირველი ფუნქცია: მომხმარებელმა უნდა შეიყვანოს სასურველი სიგრძე
# - მეორე ფუნქცია: უნდა დაგენენრირდეს შემთხვევითობის პრინციპით სასუვრელი სიგრძის პაროლი
# აუცილებელია შეიცავდეს:
#     - მხოლოდ 1 upper case-ს, 1 lower cases, ორ სპეციალურ სიმბოლოსა და 1 ციფრს.
#     - მოცემულისთვის გამოიყენეთ შესაბამის მოდულები
#     - დარჩენილი სიგრძე უნდა შეავსოთ ასევე რენდომად არჩეული სიმბოლოებით. (random.choices() გადახედეთ)
# - მეინ ფუნქცია: უნდა იყოს ყველა ზემო ფუნქციის ორკესტრატორი.

# - მოცემული ამოცანისთვის:
# 1. შექმენით ვირტუალური გარემო
# 2. გააქტიურეთ ვირტუალური გარემო
# 3. მასში დააინტალირეთ ყველა საჭირო მოდული (შეგიძლიათ თქვენი სურვილის შესაბამისად დაამატოთ ფუნქციონალი)
# 4. დაამატეთ და გამოიყენეთ type hinting 
# 5. შექმენით requirements.txt 

# დამატებითი გამოწვევა: - არასავალდებულო:
# თუ დრო და სურვილი გექნებათ, მოიძიეთ დამატებითი ბიბლიოთეკები ჰეშირებასთან დაკავშირებით და ჰეშირებული პაროლები
# შეინახეთ ფაილში